Conf.Simple/src/DataProcessors/SUI_РабочееМестоОператораОбмена/SUI_РабочееМестоОператораОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>SUI_РабочееМестоОператораОбмена</name>
</mdclass:DataProcessor>

Conf.Simple/src/InformationRegisters/SUI_СообщенияОбменаДанными/SUI_СообщенияОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_СообщенияОбменаДанными</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ВидДанных</name>
    <type>
      <types>EnumRef.SUI_ВидыДанныхСообщенийОбменаДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сворачивать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ключи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ID</name>
    <comment>Идентификатор сообщения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_КешПакетовДанных/SUI_КешПакетовДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_КешПакетовДанных</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторПакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_СостоянияМобильныхУстройств/SUI_СостоянияМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_СостоянияМобильныхУстройств</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияМобильныхУстройств</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_docs/SUI_docs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs</name>
  <resources>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>doc_n</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_countragents</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_warehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>is_barc_flow</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>use_mark</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоДокументАдресногоХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>cells_process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>CatalogRef.Удалить_SUI_МобильныеКлиенты</types>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>id_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_HTTPМетоды/SUI_HTTPМетоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_HTTPМетоды</name>
  <enumValues>
    <name>GET</name>
  </enumValues>
  <enumValues>
    <name>POST</name>
  </enumValues>
  <enumValues>
    <name>PUT</name>
  </enumValues>
  <enumValues>
    <name>PATCH</name>
  </enumValues>
  <enumValues>
    <name>DELETE</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_СостоянияМобильныхУстройств/SUI_СостоянияМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_СостоянияМобильныхУстройств</name>
  <enumValues>
    <name>ЗапросПолнойВыгрузки</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДанных</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПолучитьДанные</name>
  </enumValues>
  <enumValues>
    <name>Выгружено</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_СостоянияДокументовОбмена/SUI_СостоянияДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_СостоянияДокументовОбмена</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>КВыгрузке</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>Загружен</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/DataProcessors/SUI_РабочееМестоОператораОбмена/Forms/ОбменСПользователямиОфлайн/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьПользователей(Истина);
	ТаймаутПроверкиСвязи = Константы.SUI_ТаймаутПроверкиСвязи.Получить();
	ТаймаутВыгрузкиДанных = Константы.SUI_ТаймаутВыгрузкиДанных.Получить();
	ПроверятьСвязьСПользователямиПриОткрытииРабочегоМеста = Константы.SUI_ПроверятьСвязьСПользователямиПриОткрытииРабочегоМеста.Получить();
	СоздаватьШтрихкодыИзТСД = Константы.SUI_СоздаватьШтрихкодыИзТСД.Получить();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)   
	
	Если ПроверятьСвязьСПользователямиПриОткрытииРабочегоМеста Тогда 
		ПроверкаСвязиСПользователямиКлиент();
	КонецЕсли;
	
	Если ЭтотОбъект.ВладелецФормы <> Неопределено Тогда
		ПодготовитьСообщенияОбмена();
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМобильныеУстройства

&НаКлиенте
Процедура МобильныеУстройстваIPАдресПриИзменении(Элемент)
	
	Если Элементы.МобильныеУстройства.ТекущиеДанные <> Неопределено Тогда
		ЗаписатьНовыйIP(Элементы.МобильныеУстройства.ТекущиеДанные.МобильноеУстройство, Элементы.МобильныеУстройства.ТекущиеДанные.IPАдрес); 	
		Если ТестСвязи(Элементы.МобильныеУстройства.ТекущиеДанные.МобильноеУстройство) Тогда
			Элементы.МобильныеУстройства.ТекущиеДанные.Доступен = Истина;
		Иначе
			Элементы.МобильныеУстройства.ТекущиеДанные.Доступен = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МобильныеУстройстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя <> "МобильныеУстройстваМобильноеУстройство"
		Или Элементы.МобильныеУстройства.ТекущиеДанные = Неопределено 
		Или Элементы.МобильныеУстройства.ТекущиеДанные.МобильноеУстройство = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,Элементы.МобильныеУстройства.ТекущиеДанные.МобильноеУстройство);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьДанныеКоманда(Команда)
	
	ОчиститьСообщения();
	
	МассивПользователейКОбмену = Новый Массив;
	
	Для каждого СтрокаПользователей Из МобильныеУстройства Цикл
		Если СтрокаПользователей.Выгружать Тогда
			МассивПользователейКОбмену.Добавить(СтрокаПользователей.МобильноеУстройство);	
		КонецЕсли;
	КонецЦикла;
	
	Если Не МассивПользователейКОбмену.Количество() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны пользователи для выгрузки'"));
		Возврат;
	КонецЕсли;
	
	ВыгрузитьДанные(МассивПользователейКОбмену);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСтрокиПересчета(Команда)
	
	ОчиститьСообщения();
	
	МассивПользователейКОбмену = Новый Массив;
	
	Для каждого СтрокаПользователей Из МобильныеУстройства Цикл
		Если СтрокаПользователей.Выгружать Тогда
			МассивПользователейКОбмену.Добавить(СтрокаПользователей.МобильноеУстройство);	
		КонецЕсли;
	КонецЦикла;
	
	Если Не МассивПользователейКОбмену.Количество() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны пользователи для выгрузки'"));
		Возврат;
	КонецЕсли;
	
	ВыгрузитьДанныеГрупповогоПересчета(МассивПользователейКОбмену);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеКоманда(Команда)

	ОчиститьСообщения();
	
	МассивПользователейКОбмену = Новый Массив;
	
	Для каждого СтрокаПользователей Из МобильныеУстройства Цикл
		Если СтрокаПользователей.Выгружать Тогда
			МассивПользователейКОбмену.Добавить(СтрокаПользователей.МобильноеУстройство);	
		КонецЕсли;
	КонецЦикла;
	
	Если Не МассивПользователейКОбмену.Количество() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны пользователи для загрузки'"));
		Возврат;
	КонецЕсли;
	
	ЗагрузитьДанные(МассивПользователейКОбмену, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСтрокиПересчета(Команда)
	
	ОчиститьСообщения();
	
	МассивПользователейКОбмену = Новый Массив;
	
	Для каждого СтрокаПользователей Из МобильныеУстройства Цикл
		Если СтрокаПользователей.Выгружать Тогда
			МассивПользователейКОбмену.Добавить(СтрокаПользователей.МобильноеУстройство);	
		КонецЕсли;
	КонецЦикла;
	
	Если Не МассивПользователейКОбмену.Количество() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны пользователи для загрузки'"));
		Возврат;
	КонецЕсли;
	
	ЗагрузитьДанные(МассивПользователейКОбмену, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыборВсехПользователей(Команда)
	Для каждого Пользователь Из МобильныеУстройства Цикл	
		Пользователь.Выгружать = Ложь;		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсехПользователей(Команда)
	Для каждого Пользователь Из МобильныеУстройства Цикл	
		Пользователь.Выгружать = Истина;		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПользователей(Команда)
	ОбновлениеПользователей();    
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПолнуюВыгрузку(Команда)
	
	ОчиститьСообщения();
	
	Если Элементы.МобильныеУстройства.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.МобильныеУстройства.ТекущиеДанные.МобильноеУстройство = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	SUI_МобильныеУстройстваВызовСервера.ВыполнитьПолнуюВыгрузку(Элементы.МобильныеУстройства.ТекущиеДанные.МобильноеУстройство);
	
	ПодготовитьСообщенияОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	
	ОчиститьСообщения();
	
	Если Элементы.МобильныеУстройства.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.МобильныеУстройства.ТекущиеДанные.МобильноеУстройство = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыВладельца = Новый Структура();
	ПараметрыВладельца.Вставить("Источник", 			ЭтотОбъект);
	ПараметрыВладельца.Вставить("Уникальность", 		УникальныйИдентификатор);
	ПараметрыВладельца.Вставить("Окно", 				Окно);
	ПараметрыВладельца.Вставить("НавигационнаяСсылка", 	НавигационнаяСсылка);
	
	SUI_СообщенияМобильныхУстройствКлиент.ОтправитьСообщение(
		Элементы.МобильныеУстройства.ТекущиеДанные.МобильноеУстройство, ПараметрыВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодготовитьСообщенияОбмена()
	
	ПараметрыЗапуска = SUI_РегламентныеЗаданияКлиентСервер.ПараметрыОкнаЗапускаРегламентногоЗадания(
		SUI_СообщенияОбменаДаннымиКлиентСервер.КлючиРегламентныхЗаданий().ВыполнитьОбработкуСообщенийОбменаДанными);
	ПараметрыЗапуска.ОжидатьЗавершения = Истина;
	
	Оповещение = Новый ОписаниеОповещения("ПодготовитьСообщенияОбменаЗавершение", ЭтотОбъект);
	
	SUI_РегламентныеЗаданияКлиент.ЗапуститьРегламентноеЗаданиеВручную(ПараметрыЗапуска, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьСообщенияОбменаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И Результат.ЗаданиеВыполнено Тогда
		ОбновитьПользователей();
	КонецЕсли;
	
КонецПроцедуры

#Область Обмен

#Область ОбменОбщее

&НаСервереБезКонтекста
Функция СтрокаJSON(Знач Данные)
	
	Если Не SUI_ОбщегоНазначенияКлиентСервер.ТипыДоступенКПреобразованиюВJSON(ТипЗнч(Данные)) Тогда
		Возврат "";
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
	ЗаписатьJSON(ЗаписьJSON, Данные, , "ПреобразованиеДанныхJSON", SUI_ОбщегоНазначения);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

&НаКлиенте
Процедура ПроверкаСвязиСПользователямиКлиент() 
	
	Индикатор = ПолучитьИндикаторПроцесса(МобильныеУстройства.Количество(), НСтр("ru = 'Загрузка пользователей'"));
	ИндексОбходаДляИндикатора = 0;	
	Для Каждого Пользователь Из МобильныеУстройства Цикл 
		 
		Если Пользователь.IPАдрес <> "" Тогда  
			Пользователь.Доступен = ТестСвязи( Пользователь.МобильноеУстройство);
			Пользователь.Выгружать = (Пользователь.Доступен = Истина И Пользователь.Сообщений > 0);
		КонецЕсли;
		
		ОбработатьИндикатор(Индикатор, СтрШаблон(НСтр("ru = 'Проверка связи с пользователем %1'"), Пользователь.МобильноеУстройство), ИндексОбходаДляИндикатора);
		ИндексОбходаДляИндикатора = ИндексОбходаДляИндикатора + 1;
		
	КонецЦикла;
	
КонецПроцедуры // ПроверкаСвязиСПользователямиОбработчикОжидания()  

&НаСервере
Процедура ОбновитьПользователей(ПерезаполнитьТаблицу = Ложь)
	
	Запрос = Новый Запрос;
	
	Если ПерезаполнитьТаблицу Тогда 
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_МобильныеУстройства.Ссылка КАК Ссылка,
		|	SUI_МобильныеУстройства.Представление КАК Представление,
		|	ЛОЖЬ КАК Доступен,
		|	ВЫБОР
		|		КОГДА SUI_МобильныеУстройства.IPАдрес ЕСТЬ NULL
		|				ИЛИ SUI_МобильныеУстройства.IPАдрес = ""0.0.0.0""
		|			ТОГДА """"
		|		ИНАЧЕ SUI_МобильныеУстройства.IPАдрес
		|	КОНЕЦ КАК IP_адрес,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ SUI_СообщенияОбменаДанными.ID) + КОЛИЧЕСТВО(РАЗЛИЧНЫЕ SUI_КешПакетовДанных.ИдентификаторПакета) КАК Сообщений
		|ИЗ
		|	ПланОбмена.SUI_МобильныеУстройства КАК SUI_МобильныеУстройства
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_СообщенияОбменаДанными КАК SUI_СообщенияОбменаДанными
		|		ПО (SUI_СообщенияОбменаДанными.Получатель = SUI_МобильныеУстройства.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_КешПакетовДанных КАК SUI_КешПакетовДанных
		|		ПО (SUI_КешПакетовДанных.МобильноеУстройство = SUI_МобильныеУстройства.Ссылка)
		|ГДЕ
		|	НЕ SUI_МобильныеУстройства.ПометкаУдаления
		|	И SUI_МобильныеУстройства.Наименование <> """"
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА SUI_МобильныеУстройства.IPАдрес ЕСТЬ NULL
		|				ИЛИ SUI_МобильныеУстройства.IPАдрес = ""0.0.0.0""
		|			ТОГДА """"
		|		ИНАЧЕ SUI_МобильныеУстройства.IPАдрес
		|	КОНЕЦ,
		|	SUI_МобильныеУстройства.Ссылка,
		|	SUI_МобильныеУстройства.Представление";
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_МобильныеУстройства.МобильноеУстройство КАК МобильноеУстройство,
		|	SUI_МобильныеУстройства.Выгружать КАК Выгружать,
		|	SUI_МобильныеУстройства.Доступен КАК Доступен,
		|	SUI_МобильныеУстройства.IPАдрес КАК IPАдрес
		|ПОМЕСТИТЬ втТЧМК
		|ИЗ
		|	&ТаблицаВходная КАК SUI_МобильныеУстройства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	SUI_МобильныеУстройства.Ссылка КАК Ссылка,
		|	SUI_МобильныеУстройства.Представление КАК Представление,
		|	ВЫБОР
		|		КОГДА SUI_МобильныеУстройства.IPАдрес ЕСТЬ NULL
		|				ИЛИ SUI_МобильныеУстройства.IPАдрес = ""0.0.0.0""
		|			ТОГДА """"
		|		ИНАЧЕ SUI_МобильныеУстройства.IPАдрес
		|	КОНЕЦ КАК IP_адрес,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ SUI_СообщенияОбменаДанными.ID) + КОЛИЧЕСТВО(РАЗЛИЧНЫЕ SUI_КешПакетовДанных.ИдентификаторПакета) КАК Сообщений
		|ПОМЕСТИТЬ втТЧАктуальная
		|ИЗ
		|	ПланОбмена.SUI_МобильныеУстройства КАК SUI_МобильныеУстройства
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_СообщенияОбменаДанными КАК SUI_СообщенияОбменаДанными
		|		ПО (SUI_СообщенияОбменаДанными.Получатель = SUI_МобильныеУстройства.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_КешПакетовДанных КАК SUI_КешПакетовДанных
		|		ПО (SUI_КешПакетовДанных.МобильноеУстройство = SUI_МобильныеУстройства.Ссылка)
		|ГДЕ
		|	НЕ SUI_МобильныеУстройства.ПометкаУдаления
		|	И SUI_МобильныеУстройства.Наименование <> """"
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА SUI_МобильныеУстройства.IPАдрес ЕСТЬ NULL
		|				ИЛИ SUI_МобильныеУстройства.IPАдрес = ""0.0.0.0""
		|			ТОГДА """"
		|		ИНАЧЕ SUI_МобильныеУстройства.IPАдрес
		|	КОНЕЦ,
		|	SUI_МобильныеУстройства.Ссылка,
		|	SUI_МобильныеУстройства.Представление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЧМК.МобильноеУстройство КАК Ссылка,
		|	втТЧМК.Выгружать КАК Выгружать,
		|	втТЧМК.Доступен КАК Доступен,
		|	втТЧМК.IPАдрес КАК IP_адрес,
		|	втТЧАктуальная.Сообщений КАК Сообщений
		|ИЗ
		|	втТЧМК КАК втТЧМК
		|		ПОЛНОЕ СОЕДИНЕНИЕ втТЧАктуальная КАК втТЧАктуальная
		|		ПО втТЧМК.МобильноеУстройство = втТЧАктуальная.Ссылка";
		
		Запрос.Параметры.Вставить("ТаблицаВходная",МобильныеУстройства.Выгрузить());
		
	КонецЕсли;
	
	МобильныеУстройства.Очистить(); 
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = МобильныеУстройства.Добавить();
		НоваяСтрока.МобильноеУстройство = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.Выгружать = ВыборкаДетальныеЗаписи.Сообщений > 0;
		НоваяСтрока.Доступен = ВыборкаДетальныеЗаписи.Доступен;
		НоваяСтрока.IPАдрес = ВыборкаДетальныеЗаписи.IP_адрес; 
		НоваяСтрока.Сообщений = ВыборкаДетальныеЗаписи.Сообщений;
	КонецЦикла;
	
КонецПроцедуры // ОбновитьПользователей()

&НаКлиенте
Процедура ОбновлениеПользователей()

	ОбновитьПользователей(Истина);    
	Если ПроверятьСвязьСПользователямиПриОткрытииРабочегоМеста Тогда
		ПроверкаСвязиСПользователямиКлиент();                           
	КонецЕсли;

КонецПроцедуры // ОбновлениеПользователей()

&НаСервереБезКонтекста
Функция ПолучитьДанныеПользователя(Знач МобильноеУстройство)
	
	СтруктураДанныхПользователя = Новый Структура;
	СтруктураДанныхПользователя.Вставить("МобильноеУстройство", МобильноеУстройство);
	СтруктураДанныхПользователя.Вставить("IP", "");
	СтруктураДанныхПользователя.Вставить("ОтключеноЛогированиеПользователя", Ложь);
	СтруктураДанныхПользователя.Вставить("Код", "");
	СтруктураДанныхПользователя.Вставить("ЛогированиеАктивно", Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА SUI_МобильныеУстройства.IPАдрес ЕСТЬ NULL
	|				ИЛИ SUI_МобильныеУстройства.IPАдрес = ""0.0.0.0""
	|			ТОГДА """"
	|		ИНАЧЕ SUI_МобильныеУстройства.IPАдрес
	|	КОНЕЦ КАК IPАдрес,
	|	ЕСТЬNULL(SUI_МобильныеУстройства.Порт, 0) КАК Порт,
	|	SUI_МобильныеУстройства.ОтключитьЛогирование КАК ОтключеноЛогированиеПользователя,
	|	SUI_МобильныеУстройства.Код КАК Код,
	|	SUI_ЛогированиеHTTPЗапросов.Значение КАК ЛогированиеАктивно
	|ИЗ
	|	ПланОбмена.SUI_МобильныеУстройства КАК SUI_МобильныеУстройства,
	|	Константа.SUI_ЛогированиеHTTPЗапросов КАК SUI_ЛогированиеHTTPЗапросов
	|ГДЕ
	|	SUI_МобильныеУстройства.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", МобильноеУстройство);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Если Выборка.Порт = 0 Тогда
			СтруктураДанныхПользователя.IP = Выборка.IPАдрес;
		ИначеЕсли Не ПустаяСтрока(Выборка.IPАдрес) Тогда
			СтруктураДанныхПользователя.IP = СтрШаблон("%1:%2", Выборка.IPАдрес, Формат(Выборка.Порт,"ЧЦ=5; ЧДЦ=0; ЧГ="));
		Иначе
			СтруктураДанныхПользователя.IP = "";
		КонецЕсли;
		
		СтруктураДанныхПользователя.ОтключеноЛогированиеПользователя = Выборка.ОтключеноЛогированиеПользователя;
		СтруктураДанныхПользователя.Код = Выборка.Код;
		СтруктураДанныхПользователя.ЛогированиеАктивно = Выборка.ЛогированиеАктивно;
	
	КонецЕсли;
	
	Возврат СтруктураДанныхПользователя;
	
КонецФункции

&НаКлиенте
Функция ТестСвязи(МобильноеУстройство)
	
	ОтветСервера= ОтправитьSQLЗапросМобильноеУстройство("SyncCommand", "_", "&listener=communication_test", МобильноеУстройство, Истина);   //+Объект.Параметры  	
	Возврат ОтветСервера.ЕстьСвязь;
	
КонецФункции

//@skip-check method-optional-parameter-before-required
&НаКлиенте
Функция ОтправитьSQLЗапросМобильноеУстройство(Команда, SQLЗапрос, Параметры, МобильноеУстройство, ТестСвязи = Ложь, ЗагрузкаДанных = Ложь, ЗавершениеПередачиДанных = Ложь)  
	
	РезультатЗапроса = Новый Структура;
	РезультатЗапроса.Вставить("ЕстьСвязь", Ложь);
	РезультатЗапроса.Вставить("ДанныеОтправлены", Ложь);
	РезультатЗапроса.Вставить("Данные", Неопределено);
	
	Если SQLЗапрос = "" Тогда 
		Возврат ""; 
	ИначеЕсли  SQLЗапрос = "_" Тогда 
		SQLЗапрос = ""; 
	КонецЕсли;   
	
	Если ТестСвязи Тогда 
		ВремяОжиданияОтвета = ?(ТаймаутПроверкиСвязи > 0, ТаймаутПроверкиСвязи, 5);
	Иначе 
		ВремяОжиданияОтвета = ?(ТаймаутВыгрузкиДанных > 0, ТаймаутВыгрузкиДанных, 20);
	КонецЕсли;   
	
	СтруктураДанныхПользователя = ПолучитьДанныеПользователя(МобильноеУстройство);
	
	Соединение = Новый HTTPСоединение(СтруктураДанныхПользователя.IP,,,,,ВремяОжиданияОтвета);
	
	Заголовки = Новый Соответствие();
	
	Заголовки.Вставить("Content-Type","application/json; charset=utf-8");
	
	Запрос = Новый HTTPЗапрос("/?mode="+Команда+Параметры, Заголовки);
	
	Если Тип("ДвоичныеДанные") = ТипЗнч(SQLЗапрос) Тогда			
		Запрос.УстановитьТелоИзДвоичныхДанных(SQLЗапрос);
	Иначе			
		Запрос.УстановитьТелоИзСтроки(SQLЗапрос, КодировкаТекста.UTF8); 			
	КонецЕсли;
	
	Попытка 		
		
		ОтветСервера = Соединение.ОтправитьДляОбработки(Запрос);		
		Ответ = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(ОтветСервера.ПолучитьТелоКакСтроку());
		
		Если Не ТестСвязи И Не ЗавершениеПередачиДанных Тогда
			
			Если СтруктураДанныхПользователя.ЛогированиеАктивно И Не СтруктураДанныхПользователя.ОтключеноЛогированиеПользователя Тогда
				
				ПараметрыДобавленияЗаписиЛогирования = SUI_ЛогированиеHTTPЗапросовКлиентСервер
					.ПараметрыДобавленияЗаписиЛогирования(Запрос, ОтветСервера);
					
				ПараметрыДобавленияЗаписиЛогирования.HTTPСоединение = Соединение;
				ПараметрыДобавленияЗаписиЛогирования.ИдентификаторУстройства = СтруктураДанныхПользователя.Код;
				
				Если ЗагрузкаДанных Тогда
					ПараметрыДобавленияЗаписиЛогирования.Метод = ПредопределенноеЗначение("Перечисление.SUI_HTTPМетоды.GET");
				Иначе
					ПараметрыДобавленияЗаписиЛогирования.Метод = ПредопределенноеЗначение("Перечисление.SUI_HTTPМетоды.POST");
				КонецЕсли;
				
				SUI_ЛогированиеHTTPЗапросовКлиентСервер.ДобавитьЗаписьЛогирования(ПараметрыДобавленияЗаписиЛогирования);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТестСвязи Или ЗагрузкаДанных Тогда 
			РезультатЗапроса.ЕстьСвязь = Истина;
			РезультатЗапроса.Данные = Ответ;			
		Иначе   
			Если ОтветСервера.КодСостояния <= 200 Тогда
				РезультатЗапроса.ЕстьСвязь = Истина;
				РезультатЗапроса.ДанныеОтправлены = Истина;  
			Иначе
				РезультатЗапроса.ЕстьСвязь = Истина;
				РезультатЗапроса.ДанныеОтправлены = Ложь;  
			КонецЕсли;
		КонецЕсли;
		
	Исключение 
		
		ЗаписьВЖурналРегистрации(ИмяСобытия("Выгрузка"), ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), Истина);		
		
	КонецПопытки;	 
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#Область ОбменВыгрузка

&НаКлиенте
Функция ВыгрузитьДанные(МассивПользователейКОбмену, ПолучитьДанныеНСИ = Истина, ПолучитьДанныеДокументов = Истина)
	
	Если Не МассивПользователейКОбмену.Количество() Тогда
		Возврат Неопределено;	
	КонецЕсли;

	Индикатор = ПолучитьИндикаторПроцесса(МассивПользователейКОбмену.Количество(), НСтр("ru = 'Выгрузка данных'"));
	ИндексОбходаДляИндикатора = 0;
	
	Для каждого МобильноеУстройство Из МассивПользователейКОбмену Цикл
		
		ОбработатьИндикатор(Индикатор, СтрШаблон(НСтр("ru = 'Выгрузка на пользователя%1'"), МобильноеУстройство), ИндексОбходаДляИндикатора);
		ИндексОбходаДляИндикатора = ИндексОбходаДляИндикатора + 1;
		
		// Проверка связи
		
		ПользовательДоступен = ТестСвязи(МобильноеУстройство);
		
		Если Не ПользовательДоступен Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Пользователь %1 недоступен, проверьте подключение пользователя'"), МобильноеУстройство));		
			Продолжить;
		КонецЕсли;
		
		// Если в регистре состояния мобильных устройств полная выгрузка не выполнена тогда очищается кеш
		//@skip-check query-in-loop
		ПроверитьПолнуюВыгрузкуПользователя(МобильноеУстройство);
		ЕстьПакетыИзКеша = Ложь;
		ПакетыИзКешаОтправлены = Ложь;
		
		// Отправка из кеша пакетов
		Пока Истина Цикл
			Данные = ПолучитьПакетыИзКеша(МобильноеУстройство);
			Если Не Данные.ЕстьПакеты Тогда
				Прервать;
			КонецЕсли; 
			ЕстьПакетыИзКеша = Истина;
			ПакетКОтправке = Данные.ДанныеПакета;  
			
			//@skip-check query-in-loop
			ПакетОтправлен = ОтправитьПакетДанныхНаМУ(МобильноеУстройство,ПакетКОтправке);
			
			Если Не ПакетОтправлен.ДанныеОтправлены Тогда
				СохранитьПакетДанныхВКеш(МобильноеУстройство, ПакетКОтправке, Ложь);
				Прервать; 
			Иначе
				ПакетыИзКешаОтправлены = Истина;
			КонецЕсли;
			
			Если Данные.ОстатокПакетов = 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьПакетыИзКеша И Не ПакетыИзКешаОтправлены Тогда		
			ПоказатьПредупреждение(,СтрШаблон(НСтр("ru = 'Не удалось отправить данные на %1'"), МобильноеУстройство));
			Возврат Неопределено;
		КонецЕсли;
		
		// Получаю новые пакеты (если нет ошибки при отправке кеша пакетов)
		КоличествоИтераций = 5; 
		ДанныеОтправлены = Ложь;
		СчетчикУспешныхОтправокДанных = 0;
		Пока КоличествоИтераций >= 0 Цикл
			
			Если КоличествоИтераций = 0 Тогда				
				Прервать;
			КонецЕсли;
			
			Результат =  ПолучитьДанныеОжидание(МобильноеУстройство, ПолучитьДанныеНСИ, ПолучитьДанныеДокументов).Данные;
			ТипРезультата = ТипЗнч(Результат);
			
			Если ТипРезультата = Тип("Структура") И Результат.format = "is_ok" Тогда 
				ДанныеОтправлены = Истина;
				ЗапуститьОбработчикОжидания();   
				КоличествоИтераций = КоличествоИтераций - 1;
			ИначеЕсли ТипРезультата = Тип("Структура") И Результат.format = "no_data" Тогда 
				Прервать;   				
			ИначеЕсли (ТипРезультата = Тип("Структура") И (Результат.format = "is_data" Или Результат.format = "is_cmd")) 
				Или ТипРезультата = Тип("ДвоичныеДанные") Или ТипРезультата = Тип("Строка") Тогда
				
				Если ТипРезультата <> Тип("ДвоичныеДанные") И ТипРезультата <> Тип("Строка") Тогда   
					Результат = СтрокаJSON(Результат.data);						
				КонецЕсли;
								
				ДанныеОтправлены = Истина;
				// 1 Попытка отправить
				//@skip-check query-in-loop
				ДанныеОтправлены = ОтправитьПакетДанныхНаМУ(МобильноеУстройство, Результат).ДанныеОтправлены;
				// 2 Если не удалось отправить тогда запись в кеш пакетов и прервать цикл с выходом ошибки 
				Если Не ДанныеОтправлены Тогда
					СохранитьПакетДанныхВКеш(МобильноеУстройство, Результат, Истина);
					ДанныеОтправлены = Ложь;
					Прервать;
				Иначе
					//@skip-check query-in-loop
					ОтправитьПакетДанныхНаМУЗавершение(МобильноеУстройство);
					СчетчикУспешныхОтправокДанных = СчетчикУспешныхОтправокДанных + 1;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла; 
			
		Если ДанныеОтправлены Или ПакетыИзКешаОтправлены Тогда
			
			//@skip-check query-in-loop
			ОтправитьПакетДанныхНаМУЗавершение(МобильноеУстройство);	
			
		КонецЕсли;
		
		Если Не ДанныеОтправлены И КоличествоИтераций И СчетчикУспешныхОтправокДанных = 0 И Не ПакетыИзКешаОтправлены Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Нет данных для обмена по пользователю %1'"), МобильноеУстройство));
		ИначеЕсли Не ДанныеОтправлены И КоличествоИтераций И СчетчикУспешныхОтправокДанных > 0 И Не ПакетыИзКешаОтправлены Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Во время обмена по пользователю %1 произошла ошибка. Попробуйте повторить обмен'"), МобильноеУстройство));
		ИначеЕсли Не ДанныеОтправлены И КоличествоИтераций = 0 И Не ПакетыИзКешаОтправлены Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Не удалось отправить данные на %1'"), МобильноеУстройство));
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Данные выгружены на %1'"), МобильноеУстройство));
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьПользователей();
	
КонецФункции // ПолучитьДанные()

&НаКлиенте
Функция ВыгрузитьДанныеГрупповогоПересчета(МассивПользователейКОбмену)
	
	Если Не МассивПользователейКОбмену.Количество() Тогда
		Возврат Неопределено;	
	КонецЕсли;

	Индикатор = ПолучитьИндикаторПроцесса(МассивПользователейКОбмену.Количество(), НСтр("ru = 'Выгрузка данных'"));
	ИндексОбходаДляИндикатора = 0;
	
	Для каждого МобильноеУстройство Из МассивПользователейКОбмену Цикл
		
		ОбработатьИндикатор(Индикатор, СтрШаблон(НСтр("ru = 'Выгрузка на пользователя%1'"), МобильноеУстройство), ИндексОбходаДляИндикатора);
		ИндексОбходаДляИндикатора = ИндексОбходаДляИндикатора + 1;
		
		// Проверка связи
		
		ПользовательДоступен = ТестСвязи(МобильноеУстройство);
		
		Если Не ПользовательДоступен Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Пользователь %1 недоступен, проверьте подключение пользователя'"), МобильноеУстройство));		
			Продолжить;
		КонецЕсли;
		
		ДанныеГрупповогоПересчетаОтправлены = Ложь;
		
		ДанныеГрупповогоПересчета = ПолучитьДокументыГрупповогоПересчета(МобильноеУстройство);
		
		Если ДанныеГрупповогоПересчета <> "" Тогда
			ДанныеГрупповогоПересчетаОтправлены = ОтправитьДанныегрупповогоПересчетаНаМУ(МобильноеУстройство, ДанныеГрупповогоПересчета).ДанныеОтправлены;
		КонецЕсли; 
			
		Если ДанныеГрупповогоПересчетаОтправлены Тогда
			
			//@skip-check query-in-loop
			ОтправитьПакетДанныхНаМУЗавершение(МобильноеУстройство);	
			
		КонецЕсли;
		
		Если ДанныеГрупповогоПересчета = "" Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Нет данных для обмена по пользователю %1'"), МобильноеУстройство));
		ИначеЕсли Не ДанныеГрупповогоПересчетаОтправлены И  ДанныеГрупповогоПересчета <> "" Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Не удалось отправить данные на %1'"), МобильноеУстройство));
		ИначеЕсли ДанныеГрупповогоПересчетаОтправлены Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Отправлены данные по документам пересчета на %1'"), МобильноеУстройство));	
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьПользователей();
	
КонецФункции // ПолучитьДанные()

&НаСервереБезКонтекста
Функция ПолучитьДанныеОжидание(Знач МобильноеУстройство, Знач ПолучитьДанныеНСИ, Знач ПолучитьДанныеДокументов) 
	
	Возврат SUI_ОбменДаннымиСервер.ПолучитьДанные(SUI_МобильныеУстройстваСервер.МобильноеУстройствоФильтр(МобильноеУстройство), ПолучитьДанныеНСИ, ПолучитьДанныеДокументов, Истина);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьПолнуюВыгрузкуПользователя(Знач МобильноеУстройство)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	SUI_СостоянияМобильныхУстройств.Состояние КАК СостояниеПолнойВыгрузки
	|ИЗ
	|	РегистрСведений.SUI_СостоянияМобильныхУстройств КАК SUI_СостоянияМобильныхУстройств
	|ГДЕ
	|	SUI_СостоянияМобильныхУстройств.МобильноеУстройство = &МобильноеУстройство
	|	И SUI_СостоянияМобильныхУстройств.Состояние В (&Состояния)";
	
	Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство); 
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.SUI_СостоянияМобильныхУстройств.ФормированиеДанных);
	МассивСтатусов.Добавить(Перечисления.SUI_СостоянияМобильныхУстройств.ТребуетсяПолучитьДанные);
	
	Запрос.УстановитьПараметр("Состояния", МассивСтатусов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		РегистрыСведений.SUI_КешПакетовДанных.УдалитьПакет(МобильноеУстройство);	
		
	КонецЦикла;
	
КонецФункции // ПроверитьПолнуюВыгрузкуПользователя()

&НаСервереБезКонтекста
Функция ПолучитьПакетыИзКеша(Знач МобильноеУстройство)
	
	Возврат РегистрыСведений.SUI_КешПакетовДанных.ПолучитьПакет(МобильноеУстройство);
	
КонецФункции // ПолучитьПакетыИзКеша()

&НаСервереБезКонтекста
Функция СохранитьПакетДанныхВКеш(Знач МобильноеУстройство, Знач ПакетДанных, Знач СохранитьКакJSON)
	
	РегистрыСведений.SUI_КешПакетовДанных.СоздатьОбновитьПакет(МобильноеУстройство, ПакетДанных, СохранитьКакJSON);	
	
КонецФункции // СохранитьПакетДанныхВКеш()

&НаКлиенте
Функция ОтправитьПакетДанныхНаМУ(Знач МобильноеУстройство, Знач ПакетДанных)
	
	Возврат ОтправитьSQLЗапросМобильноеУстройство("SyncCommand", ПакетДанных, "&listener=put_data", МобильноеУстройство); 	
	
КонецФункции // ОтправитьПакетДанныхНаМУ()

&НаКлиенте
Функция ОтправитьДанныегрупповогоПересчетаНаМУ(Знач МобильноеУстройство, Знач ПакетДанных)
	
	Возврат ОтправитьSQLЗапросМобильноеУстройство("SyncCommand", ПакетДанных, "&listener=put_document_lines", МобильноеУстройство); 	
	
КонецФункции // ОтправитьПакетДанныхНаМУ()
         
&НаКлиенте
Функция ПолучитьПакетДанныхНаМУ(МобильноеУстройство, ГрупповойПересчет = Ложь)
	
	СтруктураВозврата = Новый Структура;
	Если ГрупповойПересчет Тогда
		СтруктураВозврата.Вставить("ДокументыГрупповаяРабота", ОтправитьSQLЗапросМобильноеУстройство("SyncCommand", "_", "&listener=document_lines", МобильноеУстройство, ,Истина)); 			
	Иначе
		СтруктураВозврата.Вставить("Документы", ОтправитьSQLЗапросМобильноеУстройство("SyncCommand", "_", "&listener=get_data", МобильноеУстройство, ,Истина)); 	
		Если СоздаватьШтрихкодыИзТСД Тогда
			СтруктураВозврата.Вставить("Штрихкоды", ОтправитьSQLЗапросМобильноеУстройство("SyncCommand", "_", "&listener=barcodes", МобильноеУстройство, ,Истина)); 
		КонецЕсли;  
	КонецЕсли;

	Возврат СтруктураВозврата;
	
КонецФункции // ОтправитьПакетДанныхНаМУ()

&НаКлиенте
Функция ОтправитьПакетДанныхНаМУЗавершение(МобильноеУстройство)
	
	Возврат ОтправитьSQLЗапросМобильноеУстройство("SyncCommand", "_", "&listener=put_data_finish", МобильноеУстройство, Истина); 	
	
КонецФункции // ОтправитьПакетДанныхНаМУЗавершение()

&НаСервереБезКонтекста
Функция ПолучитьДокументыГрупповогоПересчета(МобильноеУстройство)

	Запрос = Новый Запрос;
	
	Параметр = Новый СписокЗначений;
	Параметр.Добавить(Перечисления.SUI_СостоянияДокументовОбмена.Завершен);
	Параметр.Добавить(Перечисления.SUI_СостоянияДокументовОбмена.Отменен);
	Параметр.Добавить(Перечисления.SUI_СостоянияДокументовОбмена.Новый);
	Запрос.УстановитьПараметр("Состояние", Параметр);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	SUI_docs.id_doc КАК ИдентификаторДокумента
	|ИЗ
	|	РегистрСведений.SUI_docs КАК SUI_docs
	|ГДЕ
	|	SUI_docs.НастройкаДокумента.ГрупповоеСканирование
	|	И НЕ SUI_docs.Состояние В (&Состояние)";
	Результат = Запрос.Выполнить();
	
	// Выборка
	Выборка = Результат.Выбрать();
	
	МассивВсехДокументов = Новый Массив;
	ДанныеДляВозврата = "";
	
	Пока Выборка.Следующий() Цикл
		МассивПоДокументу = SUI_ДокументыОбмена.ПолучитьДанныеПересчетаСтрок(МобильноеУстройство, Выборка.ИдентификаторДокумента);  
		Для Каждого ЭлементМассива Из МассивПоДокументу Цикл
			МассивВсехДокументов.Добавить(ЭлементМассива); 
		КонецЦикла;
	КонецЦикла;
	
	Если МассивВсехДокументов.Количество() Тогда
		ДанныеДляВозврата = SUI_ОбщегоНазначенияКлиентСервер.ДанныеВСтрокуJSON(МассивВсехДокументов, , "ПреобразованиеДанныхJSON", SUI_ОбщегоНазначения);
		ДанныеДляВозврата = "{""data"":" + ДанныеДляВозврата + Символы.ПС + "}"; 	
	КонецЕсли;
	
	Возврат ДанныеДляВозврата;
	
КонецФункции

#КонецОбласти

#Область ОбменЗагрузка

&НаКлиенте
Функция ЗагрузитьДанные(МассивПользователейКОбмену, ГрупповойПересчет)
	
	Если Не МассивПользователейКОбмену.Количество() Тогда
		Возврат Ложь;	
	КонецЕсли;	
	
	Индикатор = ПолучитьИндикаторПроцесса(МассивПользователейКОбмену.Количество(), НСтр("ru = 'Загрузка данных'"));
	ИндексОбходаДляИндикатора = 0;
	
	Для каждого МобильноеУстройство Из МассивПользователейКОбмену Цикл
		
		ОбработатьИндикатор(Индикатор, СтрШаблон(НСтр("ru = 'Загрузка данных пользователя %1'"), МобильноеУстройство), ИндексОбходаДляИндикатора);
		ИндексОбходаДляИндикатора = ИндексОбходаДляИндикатора + 1;	 
		
		// Проверка связи
		
		ПользовательДоступен = ТестСвязи(МобильноеУстройство);
		
		Если Не ПользовательДоступен Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Пользователь %1 недоступен, проверьте подключение пользователя'"), МобильноеУстройство));
			Продолжить;
		КонецЕсли; 
		
		// Получение данных
		
		//@skip-check query-in-loop
		ДанныеСМУ = ПолучитьПакетДанныхНаМУ(МобильноеУстройство, ГрупповойПересчет);
		
		Если Не ГрупповойПересчет Тогда
			// Документы
			Если Не ДанныеСМУ.Документы.ЕстьСвязь Тогда 
				ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Не удалость загрузить данные по пользователю %1, проверьте подключение пользователя'"), МобильноеУстройство));			
				Продолжить;			
			КонецЕсли; 
			
			Если ДанныеСМУ.Документы.Данные = Неопределено Тогда 
				ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Нет данных для загрузки по пользователю %1'"), МобильноеУстройство));			
				Продолжить;			
			КонецЕсли;
			
			ДанныеЗагружены = Ложь;
			Если ДанныеСМУ.Документы.Данные <> "[]" Тогда 
				РезультатЗагрузкиДокументы = ЗаписатьДанныеДокументовИзМУ(ДанныеСМУ.Документы.Данные, МобильноеУстройство);
				Если РезультатЗагрузкиДокументы.quantity_uploaded <> 0 Тогда 
					ДанныеЗагружены = Истина;			
				КонецЕсли;
			КонецЕсли;
			
			// Штрихкоды 
			Если СоздаватьШтрихкодыИзТСД Тогда
				РезультатЗагрузкиШтрихкоды = ЗаписатьДанныеШтрихкодовИзМУ(ДанныеСМУ.Штрихкоды.Данные, МобильноеУстройство);
				
				Если РезультатЗагрузкиШтрихкоды.quantity_uploaded <> 0 Тогда 
					ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Штрихкоды загружены по пользователю %1'"), МобильноеУстройство));			
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			ДанныеЗагружены = Ложь;
			Если ДанныеСМУ.ДокументыГрупповаяРабота.Данные <> "[]" И ДанныеСМУ.ДокументыГрупповаяРабота.Данные <> Неопределено Тогда
				ДанныеЗагружены = ЗаписатьДанныеДокументовИзМУГрупповая(ДанныеСМУ.ДокументыГрупповаяРабота.Данные, МобильноеУстройство);
			КонецЕсли;
			
		КонецЕсли;
			
		Если ДанныеЗагружены Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Данные загружены по пользователю %1'"), МобильноеУстройство));	
		Иначе 
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Нет данных для загрузки по пользователю %1'"), МобильноеУстройство));		
		КонецЕсли;	
		
	КонецЦикла;
	
КонецФункции // ЗагрузитьДанные()

&НаСервереБезКонтекста
Функция ЗаписатьДанныеДокументовИзМУ(Знач ДанныеСМУДокументы, Знач МобильноеУстройство)
		
	ДанныеДокументов = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеСМУДокументы, Ложь, , ,
		"ВосстановлениеДанныхJSON_ДанныеДокумента", SUI_ОбменДаннымиСервер);
	Возврат SUI_ОбменДаннымиСервер.ЗагрузитьДанныеДокументов(МобильноеУстройство, ДанныеДокументов, Истина);
	
КонецФункции // ЗаписатьДанныеИзМУ()

&НаСервереБезКонтекста
Функция ЗаписатьДанныеДокументовИзМУГрупповая(Знач ДанныеСМУДокументы, Знач МобильноеУстройство)
			
	СтрокиДокумента = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеСМУДокументы, Ложь, , ,
				"ВосстановлениеДанныхJSON_ПересчетТоваровДокумента", SUI_ОбменДаннымиСервер);

	Возврат SUI_ОбменДаннымиСервер.ЗагрузитьДанныеГрупповогоПересчетаДокумента(МобильноеУстройство, 
	"", СтрокиДокумента);
	
		
КонецФункции // ЗаписатьДанныеИзМУ()

&НаСервереБезКонтекста
Функция ЗаписатьДанныеШтрихкодовИзМУ(Знач ДанныеСМУШтрихкоды, Знач МобильноеУстройство)
	
	ДанныеШтрихкодов = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеСМУШтрихкоды, Ложь, , ,
		"ВосстановлениеДанныхJSON_СоздатьШтрихкодыНоменклатуры", SUI_ОбменДаннымиСервер);
	Возврат SUI_ОбменДаннымиСервер.СоздатьШтрихкодыНоменклатуры(МобильноеУстройство, ДанныеШтрихкодов, Истина);
	
КонецФункции // ЗаписатьДанныеИзМУ()

#КонецОбласти

#КонецОбласти

#Область ОбработчикОжидания

&НаКлиенте
Процедура ЗапуститьОбработчикОжидания() 
	ПодключитьОбработчикОжидания("Ожидание", 5, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Ожидание() 
	Возврат;			
КонецПроцедуры

#КонецОбласти

#Область ОбработкаИндикатора

//@skip-check method-optional-parameter-before-required
&НаКлиенте
Процедура ОбработатьИндикатор(Индикатор, ПредставлениеПроцесса, Счетчик = 0)
	
	Индикатор.ПредставлениеПроцесса = ПредставлениеПроцесса;
	Если Индикатор.ВнутреннийСчетчик Тогда
		Индикатор.Счетчик = Индикатор.Счетчик + 1;
		Счетчик = Индикатор.Счетчик;
	КонецЕсли;
	Если Индикатор.РазрешитьПрерывание Тогда
		ОбработкаПрерыванияПользователя();
	КонецЕсли;
	
	Если Счетчик > Индикатор.СледующийСчетчик Тогда
		Индикатор.СледующийСчетчик = Цел(Счетчик + Индикатор.Шаг);
		Если Индикатор.ЛиВыводитьВремя Тогда
			ПрошлоВремени = ОбщегоНазначенияКлиент.ДатаСеанса() - Индикатор.ДатаНачалаПроцесса;
			Осталось = ПрошлоВремени * (Индикатор.КоличествоПроходов / Счетчик - 1);
			Часов = Цел(Осталось / 3600);
			Осталось = Осталось - (Часов * 3600);
			Минут = Цел(Осталось / 60);
			Секунд = Цел(Цел(Осталось - (Минут * 60)));
			ОсталосьВремени = Формат(Часов, "ЧЦ=2; ЧН=00; ЧВН=") + ":" + Формат(Минут, "ЧЦ=2; ЧН=00; ЧВН=") + ":"
			+ Формат(Секунд, "ЧЦ=2; ЧН=00; ЧВН=");
			ТекстОсталось = "Осталось: ~" + ОсталосьВремени;
		Иначе
			ТекстОсталось = "";
		КонецЕсли;
		
		Если Индикатор.КоличествоПроходов > 0 Тогда
			ТекстСостояния = ТекстОсталось;
		Иначе
			ТекстСостояния = "";
		КонецЕсли;
		
		Состояние(Индикатор.ПредставлениеПроцесса, Счетчик / Индикатор.КоличествоПроходов * 100, ТекстСостояния);
	КонецЕсли;
	
	Если Счетчик = Индикатор.КоличествоПроходов Тогда
		Состояние(Индикатор.ПредставлениеПроцесса, 100, ТекстСостояния);
	КонецЕсли;
	
КонецПроцедуры // ОбработатьИндикатор()

&НаКлиенте
Функция ПолучитьИндикаторПроцесса(КоличествоПроходов, ПредставлениеПроцесса = "Выгрузка")
	
	Индикатор = Новый Структура;
	Индикатор.Вставить("КоличествоПроходов", КоличествоПроходов);
	Индикатор.Вставить("ДатаНачалаПроцесса", ОбщегоНазначенияКлиент.ДатаСеанса());
	Индикатор.Вставить("ПредставлениеПроцесса", ПредставлениеПроцесса);
	Индикатор.Вставить("ЛиВыводитьВремя", Истина);
	Индикатор.Вставить("РазрешитьПрерывание", Ложь);
	Индикатор.Вставить("ВнутреннийСчетчик", Истина);
	Индикатор.Вставить("Шаг", КоличествоПроходов / 100);
	Индикатор.Вставить("СледующийСчетчик", 0);
	Индикатор.Вставить("Счетчик", 0);
	Возврат Индикатор;
	
КонецФункции // ЛксПолучитьИндикаторПроцесса()

&НаСервереБезКонтекста
Функция ПолучитьМобильноеУстройствоПоКлиенту(Знач МобильноеУстройство)

	Возврат SUI_МобильныеУстройстваСервер.МобильноеУстройствоФильтр(МобильноеУстройство);

КонецФункции // ПолучитьМобильноеУстройствоПоКлиенту()
                                   
#КонецОбласти

#Область Логирование
 
&НаСервереБезКонтекста
Процедура ЗаписатьHTTPЗапросВЛоги(Знач Данные)
	
	// artem - 28.11.2024 - 
	//SUI_ЛогированиеHTTPЗапросов.ЗаписатьЛог(Данные);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписьВЖурналРегистрации(Знач ИмяСобытия, Знач Комментарий, Знач ЗаписьОшибки = Ложь)
	
	SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия, ?(ЗаписьОшибки, УровеньЖурналаРегистрации.Ошибка, УровеньЖурналаРегистрации.Информация),,,Комментарий);	
	
КонецПроцедуры

// Функция - Имя события
// Формирование имени события для записи в журнале регистрации
// Параметры:
//  ВложенноеСобытие - Строка - Наименование события для формирования записи в журнале регистрации 
// 
// Возвращаемое значение:
//  Строка - Имя события
//
&НаСервереБезКонтекста
Функция ИмяСобытия(Знач ВложенноеСобытие = "")
	
	Возврат "Рабочее место оператора. Офлайн обмен. " + ?(ЗначениеЗаполнено(ВложенноеСобытие),". " + ВложенноеСобытие, "");
	
КонецФункции // ИмяСобытия()

#КонецОбласти

// Процедура - Записать новый IP
// Записывает измененный IP пользователя 
// Параметры:
//  Пользователь - ПланОбмена.SUI_МобильныеУстройства - ссылка на мобильного пользователя 
//  IPАдресНовый - Строка - новый IP адрес
//
&НаСервереБезКонтекста
Процедура ЗаписатьНовыйIP(Знач Пользователь, Знач IPАдресНовый)
	
	НачатьТранзакцию();
	Попытка                                  
		Объект = Пользователь.ПолучитьОбъект();
		Если Объект = Неопределено Тогда 
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		ЗаблокироватьДанныеДляРедактирования(Пользователь);
		
		Объект.IPАдрес = IPАдресНовый;
		Объект.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры // ЗаписатьНовыйIP()

&НаСервереБезКонтекста
Функция КодМобильногоУстройства(МобильноеУстройство)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МобильноеУстройство, "Код");
КонецФункции

#КонецОбласти
